<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>

  <resources>
    <stringTable>
      <string id="Sup_GoogleUpdate1_2_145_5">Microsoft Edge Update 1.2.145.5 ja sitä uudemmat</string>
      <string id="Sup_GoogleUpdate1_3_21_81">Microsoft Edge Update 1.3.21.81 ja sitä uudemmat</string>
      <string id="Sup_GoogleUpdate1_3_26_0">Microsoft Edge Update 1.3.26.0 ja sitä uudemmat</string>
      <string id="Sup_GoogleUpdate1_3_33_5">Microsoft Edge Update 1.3.33.5 ja sitä uudemmat</string>
      <string id="Sup_GoogleUpdate1_3_34_3">Microsoft Edge Update 1.3.34.3 ja sitä uudemmat</string>
      <string id="Sup_EdgeUpdate1_3_119_43">Microsoft Edge Update 1.3.119.43 ja uudempi</string>
      <string id="Sup_EdgeUpdate1_3_128_0">Microsoft Edge Update 1.3.128.0 ja uudempi</string>
      <string id="Sup_EdgeUpdate1_3_127_1">Microsoft Edge Update 1.3.127.1 ja uudempi</string>
      <string id="Sup_EdgeUpdate1_3_133_3">Microsoft Edge Update 1.3.133.3 ja uudemmat versiot</string>
      <string id="Sup_EdgeUpdate1_3_145_1">Microsoft Edge Updaten 1.3.145.1 ja uudemmat versiot</string>
      <string id="Cat_Google">Microsoft</string>
      <string id="Cat_GoogleUpdate">Microsoft Edge -päivitys</string>
      <string id="Cat_Preferences">Asetukset</string>
      <string id="Cat_ProxyServer">Välityspalvelin</string>
      <string id="Cat_Applications">Sovellukset</string>
      <string id="Cat_WebView">Microsoft Edgen WebView</string>
      <string id="Pol_AutoUpdateCheckPeriod">Automaattisten päivitysten tarkistuksen ajanjakson korvaus</string>
      <string id="Pol_UpdateCheckSuppressedPeriod">Joka päivä tapahtuva ajanjakso, jolloin automaattisten päivitysten tarkistus estetään</string>
      <string id="Pol_DownloadPreference">Lataa URL-luokan korvaus</string>
      <string id="Pol_ProxyMode">Valitse välitys palvelimen asetusten määrittäminen</string>
      <string id="Pol_ProxyServer">Välityspalvelimen osoite tai URL-osoite</string>
      <string id="Pol_ProxyPacUrl">Välityspalvelimen .pac-tiedoston URL-osoite</string>
      <string id="Pol_DefaultAllowInstallation">Salli asennus oletusarvoisesti</string>
      <string id="Pol_AllowInstallation">Salli asennus</string>
      <string id="Pol_DefaultUpdatePolicy">Korvaa oletusarvoinen päivityskäytäntö</string>
      <string id="Pol_UpdatePolicy">Päivityskäytännön korvaus</string>
      <string id="Pol_DefaultCreateDesktopShortcut">Estä pikakuvakkeen luominen työpöydälle asennuksen yhteydessä (oletus)</string>
      <string id="Pol_CreateDesktopShortcut">Estä pikakuvakkeen luominen työpöydälle asennuksen yhteydessä</string>
      <string id="Pol_TargetVersionPrefix">Kohdeversion ohitus</string>
      <string id="Pol_RollbackToTargetVersion">Palauta kohdeversioon</string>
      <string id="Pol_AllowSideBySideExperience">Salli Microsoft Edgen samanaikainen selainkokemus</string>
      <string id="Pol_ECSControl">Hallitse päivitystyökalun kokeilu- ja määrityspalvelun kanssa tapahtuvaa tiedonsiirtoa</string>
      <string id="Part_AutoUpdateCheckPeriod">Päivitysten tarkistusten väliset minuutit</string>
      <string id="Part_UpdateCheckSuppressedStartHour">Tunnit kellonajalle, jolloin päivitysten tarkastamisen estäminen alkaa</string>
      <string id="Part_UpdateCheckSuppressedStartMin">Minuutit kellonajalle, jolloin päivitysten tarkastamisen estäminen alkaa</string>
      <string id="Part_UpdateCheckSuppressedDurationMin">Moneksiko minuutiksi päivitysten tarkistus estetään päivittäin</string>
      <string id="Part_ProxyMode">Valitse välitys palvelimen asetusten määrittäminen</string>
      <string id="Part_ProxyServer">Välityspalvelimen osoite tai URL-osoite</string>
      <string id="Part_ProxyPacUrl">Välityspalvelimen .pac-tiedoston URL-osoite</string>
      <string id="Part_UpdatePolicy">Päivityskäytäntö</string>
      <string id="Part_TargetVersionPrefix">Kohdeversio</string>
      <string id="Part_ECSControl">Hallitse päivitystyökalun kokeilu- ja määrityspalvelun kanssa tapahtuvaa tiedonsiirtoa</string>
      <string id="Name_UpdatesEnabled">Salli päivitykset aina (suositus)</string>
      <string id="Name_ManualUpdatesOnly">Vain manuaaliset päivitykset</string>
      <string id="Name_AutomaticUpdatesOnly">Vain automaattiset hiljaiset päivitykset</string>
      <string id="Name_UpdatesDisabled">Päivitykset poistettu käytöstä</string>
      <string id="Name_ECSCommunicationDisabled">Poista tietoliikenne testi- ja määrityspalvelun kanssa käytöstä</string>
      <string id="Name_ECSCommunicationEnabled">Ota tiedonsiirto käyttöön ja lataa kokeet</string>
      <string id="DownloadPreference_DropDown">Välimuistiin tallennettavat lataus-URL-osoitteet</string>
      <string id="ProxyDisabled_DropDown">Älä koskaan käytä välityspalvelinta</string>
      <string id="ProxyAutoDetect_DropDown">Tunnista välityspalvelimen asetukset automaattisesti</string>
      <string id="ProxyPacScript_DropDown">Käytä .pac-välityspalvelimen komentosarjaa</string>
      <string id="ProxyFixedServers_DropDown">Käytä kiinteitä välityspalvelimia</string>
      <string id="ProxyUseSystem_DropDown">Käytä järjestelmän välityspalvelimen asetuksia</string>
      <string id="Explain_GoogleUpdate">Käytäntöasetukset, joiden avulla ohjataan Microsoft Edgen asentamista ja päivittämistä käyttämällä Microsoft Edge Updatea.</string>
      <string id="Explain_Preferences">Microsoft Edge Updaten yleiset käytännöt.</string>
      <string id="Explain_AutoUpdateCheckPeriod">Jos tämä käytäntöasetus on otettu käyttöön, voit määrittää minuuttien vähimmäismäärän automaattisten päivitysten tarkistusten välillä. Muutoin automaattiset päivitykset tarkistetaan oletusarvoisesti 10 tunnin välein.

  Jos haluat poistaa kaikki automaattisten päivitysten tarkistukset käytöstä, määritä arvoksi 0 (tätä ei suositella).</string>
      <string id="Explain_DownloadPreference">Jos tämä on käytössä, Microsoft Edge Update -palvelin yrittää tarjota vastauksissaan välimuistille sopivia URL-osoitteita päivitystietoja varten.</string>
      <string id="Explain_UpdateCheckSuppressedPeriod">Jos otat tämän käytäntöasetuksen käyttöön, päivitysten tarkistus estetään joka päivä klo Tunti:Minuutti alkaen määritetyn ajanjakson ajaksi (minuutteina). Kesäaika ei vaikuta tähän ajanjaksoon. Jos esimerkiksi aloitusaika on klo 22:00 ja kesto 480 minuuttia, päivitykset estetään tarkalleen kahdeksan tunnin ajan riippumatta siitä, alkaako tai loppuuko kesäaika tämän ajanjakson aikana.

  Jos poistat tämän käytäntöasetuksen käytöstä tai et määritä sitä, päivitysten tarkistusta ei estetä tiettynä ajanjaksona.</string>
      <string id="Explain_ProxyMode">Tämän avulla voit määrittää Microsoft Edge Updaten käyttämät välityspalvelinasetukset.

  Jos käytäntö otetaan käyttöön, voit valita seuraavien välityspalvelinasetusten välillä:
   - Jos et halua koskaan käyttää välityspalvelinta vaan muodostaa aina yhteyden suoraan, kaikki muut asetukset ohitetaan.
   - Jos haluat käyttää järjestelmän välityspalvelinasetuksia tai tunnistaa välityspalvelimen automaattisesti, kaikki muut asetukset ohitetaan. 
   - Jos haluat käyttää kiinteää palvelin välityspalvelintilaa, voit määrittää lisäasetuksia käytännössä Välityspalvelimen osoite tai URL-osoite.
   - Jos haluat käyttää .pac-välityspalvelimen komentosarjaa, sinun täytyy määrittää komentosarjan URL-osoite käytännössä Välityspalvelimen .pac-tiedoston URL-osoite.

  Jos tämä käytäntö otetaan käyttöön, organisaation käyttäjät eivät voi muuttaa Microsoft Edge Updaten välityspalvelinasetuksia.

  Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, välityspalvelinasetuksia ei määritetä, mutta organisaation käyttäjät voivat valita omat välityspalvelinasetuksensa, joita Microsoft Edge Update käyttää.</string>
      <string id="Explain_ProxyServer">Tämän avulla voit määrittää Microsoft Edge Updaten käyttämän välityspalvelimen URL-osoitteen.

  Jos käytäntö otetaan käyttöön, voit määrittää Microsoft Edge Updaten organisaatiossasi käyttämän välityspalvelimen URL-osoitteen.

  Käytäntö otetaan käyttöön vain, jos olet valinnut manuaaliset välityspalvelinasetukset käytännössä Valitse välitys palvelimen asetusten määrittäminen.

  Älä määritä tätä käytäntöä, jos olet valinnut muut kuin manuaaliset välityspalvelinasetukset käytännössä Valitse välitys palvelimen asetusten määrittäminen.</string>
      <string id="Explain_ProxyPacUrl">Tämän avulla voit määrittää välityspalvelimen automaattisen määritystiedoston (PAC) URL-osoitteen.

  Jos käytäntö otetaan käyttöön, voit määrittää PAC-tiedoston URL-osoitteen automatisoidaksesi sen, miten Microsoft Edge Update valitsee sopivan välityspalvelimen tietyn verkkosivuston hakemiseen.

  Käytäntö otetaan käyttöön vain, jos olet valinnut manuaaliset välityspalvelinasetukset käytännössä Valitse välitys palvelimen asetusten määrittäminen.

  Älä määritä tätä käytäntöä, jos olet valinnut muut kuin manuaaliset välityspalvelinasetukset käytännössä Valitse välitys palvelimen asetusten määrittäminen.</string>
      <string id="Explain_Applications">Päivitetty ADMX/ADML-malli tarvitaan tulevaisuudessa julkaistavien Microsoft Edge -sovellusten tukemiseen.</string>
      <string id="Explain_AllowSideBySideExperience">Tämän käytäntöasetuksen avulla käyttäjä voi suorittaa Microsoft Edge (Edge HTML)- ja Microsoft Edge (Chromium) -versioita samanaikaisesti.

Jos tämän käytäntöasetuksen arvoksi määritetään Ei määritetty, Microsoft Edge (Chromium) korvaa Microsoft Edge (Edge HTML) -version sen jälkeen, kun stabiili Microsoft Edge (Chromium) -kanava ja marraskuun 2019 suojauspäivitykset on asennettu. Tämä vastaa Ei käytössä -arvoa.

Ei käytössä -arvo estää samanaikaisen käytön ja Microsoft Edge (Chromium) korvaa Microsoft Edge (Edge HTML) -version sen jälkeen, kun stabiili Microsoft Edge (Chromium) -kanava ja marraskuun 2019 suojauspäivitykset on asennettu. Tämä vastaa Ei määritetty -arvoa.

Jos tämän käytäntöasetuksen arvoksi määritetään Käytössä, Microsoft Edge (Chromium)- ja Microsoft Edge (Edge HTML) -versioita voidaan suorittaa samanaikaisesti sen jälkeen, kun Microsoft Edge (Chromium) on asennettu.

Jotta tämä käytäntöasetus tulee voimaan, se on määritettävä ennen kuin Windows Update asentaa Microsoft Edge (Chromium) -version automaattisesti. Huomautus: Käyttäjä voi estää Microsoft Edge (Chromium) -version automaattisen asentamisen Microsoft Edge (Chromium-based) Blocker -työkalupaketin avulla.

Vanhaa Microsoft Edgeä ja rinnakkaisselaamista ei tueta Windows 10:n 20H2-versiosta alkaen.</string>
      <string id="Explain_DefaultAllowInstallation">Voit määrittää kaikkien kanavien oletustoiminnaksi Microsoft Edgen sallimisen tai estämisen toimialueeseen liitetyissä laitteissa.

Tämän käytännön voi ohittaa yksittäisillä kanavilla määrittämällä käytännön Salli asennus kyseisille kanaville.

Jos poistat tämän käytännön käytöstä, Microsoft Edgen asennus estetään. Tämä koskee Microsoft Edge -ohjelmiston asennusta vain silloin, kun käytäntöä Salli asennus ei ole määritetty.

Tämä käytäntö ei estä Microsoft Edge Updaten suorittamista tai käyttäjiä asentamasta Microsoft Edge -ohjelmistoa muilla tavoilla.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_DefaultUpdatePolicy">Tämän käytäntöasetuksen avulla voit määrittää kaikkien niiden kanavien oletustoiminnan, jotka liittyvät Microsoft Edge Updaten tapaan käsitellä Microsoft Edgelle saatavilla olevia päivityksiä. Tämä käytäntöasetus voidaan ohittaa yksittäisissä kanavissa määrittämällä KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetus kyseisille kanaville.

  Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti.
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_DefaultCreateDesktopShortcut">Voit määrittää kaikille kanaville oletustoiminnon työpöydän pikakuvakkeen luomiselle, kun Microsoft Edge asennetaan.

  Jos otat tämän käytännön käyttöön, työpöydän pikakuvake luodaan, kun Microsoft Edge asennetaan.
  Jos poistat tämän käytännön käytöstä, työpöydän pikakuvaketta ei luoda, kun Microsoft Edge asennetaan.
  Jos tätä käytäntöä ei määritetä, ohjelma luo Microsoft Edgen työpöydän pikakuvakkeen asennuksen aikana.
  Jos Microsoft Edge on jo asennettuna, tällä käytännöllä ei ole vaikutusta.</string>
      <string id="Explain_CreateDesktopShortcut">Jos otat tämän käytännön käyttöön, työpöydän pikakuvake luodaan, kun Microsoft Edge asennetaan.
  Jos poistat tämän käytännön käytöstä, työpöydän pikakuvaketta ei luoda, kun Microsoft Edge asennetaan.
  Jos tätä käytäntöä ei määritetä, ohjelma luo Microsoft Edgen työpöydän pikakuvakkeen asennuksen aikana.
   Jos Microsoft Edge on jo asennettuna, tällä käytännöllä ei ole vaikutusta.

  Jos et määritä tätä käytäntöä kanavalle, oletuskäytäntö Estä pikakuvakkeen luominen työpöydälle asennuksen yhteydessä (oletus) määrittää pikakuvakkeen luomisen Microsoft Edgen asennuksen yhteydessä.</string>
      <string id="Explain_WebView">Määrittää käytännöt Microsoft Edgen WebView-komponentille.</string>
      <string id="Explain_WebView_AutoUpdate">Ominaisuuden avulla voit määrittää, ovatko automaattiset päivitykset käytössä Microsoft Edgen WebView-komponentissa. Microsoft Edgen WebView-komponentin avulla sovellukset näyttävät verkkosisältöä.
  Automaattiset päivitykset ovat oletusarvoisesti käytössä. Microsoft Edgen WebView-komponentin automaattisten päivitysten poistaminen käytöstä voi aiheuttaa yhteensopivuusongelmia sovelluksissa, jotka käyttävät tätä komponenttia.

  Jos otat tämän käytännön käyttöön, Microsoft Edge Update käsittelee Microsoft Edgen WebView-päivitykset sen mukaan, miten määrität seuraavat asetukset:
  -Salli päivitykset aina: päivitykset ladataan ja otetaan käyttöön automaattisesti,
  - Päivitykset pois käytöstä: päivityksiä ei koskaan ladata tai oteta käyttöön

 Jos tätä käytäntöä ei oteta käyttöön, päivitykset ladataan ja otetaan automaattisesti käyttöön.</string>
      <string id="Explain_WebView_Install">Tämän avulla voit määrittää, voiko Microsoft Edgen WebView-komponentin asentaa Microsoft Edge Updatella.

  - Jos otat tämän käytännön käyttöön, käyttäjät voivat asentaa Microsoft Edgen WebView-komponentin Microsoft Edge Updatella.
  - Jos poistat tämän käytännön käytöstä, käyttäjät eivät voi asentaa Microsoft Edgen WebView-komponenttia Microsoft Edge Updatella.
  - Jos tätä käytäntöä ei määritetä, oletusarvoinen käytäntömääritys 'Salli asennus oletusarvoisesti' määrittää, voivatko käyttäjät asentaa Microsoft Edgen WebView-komponentin Microsoft Edge Updatella.</string>
      <string id="Explain_ECSControl">Microsoft Edge Updatessa kokeilutietojen käyttöönottoon käytetään kokeilu- ja määrityspalvelua.

Kokeilutiedot koostuvat luettelosta kehityksessä olevia ominaisuuksia, jotka Microsoft ottaa käyttöön testausta ja palautetta varten.

Jos otat tämän käytännön käyttöön, kokeilutiedot ladataan kokeilu- ja määrityspalvelusta.

Jos poistat käytännön käytöstä, viestintä kokeilu- ja määrityspalvelun kanssa keskeytetään kokonaan.

Jos et määritä tätä käytäntöä, hallitussa laitteessa toimitaan kuin käytäntö olisi poistettu käytöstä.

Jos et määritä tätä käytäntöä, ei-hallitussa laitteessa toimitaan kuin käytäntö olisi otettu käyttöön.</string>
      <string id="Cat_MicrosoftEdge">Microsoft Edge</string>
      <string id="Explain_InstallMicrosoftEdge">Määrittää, voiko Microsoft Edgen kanavan asentaa toimialueeseen liitettyihin laitteisiin.

  Jos otat tämän käytännön käyttöön kanavalla, Microsoft Edgen asennus sallitaan.

  Jos poistat tämän käytännön käytöstä kanavalla, Microsoft Edgen asennus estetään.

  Jos tätä käytäntöä ei määritetä kanavalla, oletusarvoinen käytäntömääritys Salli asennus oletusarvoisesti määrittää, voivatko käyttäjät asentaa Microsoft Edgen kanavan.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_AutoUpdateMicrosoftEdge">Määrittää, miten Microsoft Edge Update käsittelee Microsoft Edgelle saatavilla olevia päivityksiä.

Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti. (Kaikki sovellukset eivät sisällä tätä ominaisuutta.)
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset OLETUSARVOISEN KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136406.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_TargetChannelMicrosoftEdge">Specifies which Channel Microsoft Edge should be updated to.

When this policy is enabled, the app will be updated to the Channel with this policy value.

Some examples:
1) Not configured: app will be updated to the latest version available in the default Channel for the app.
2) Policy value is set to "stable": the app will be updated to the latest stable version.
2) Policy value is set to "beta": the app will be updated to the latest beta version.
2) Policy value is set to "dev": the app will be updated to the latest dev version.
This policy is available only on Windows instances that are joined to a Microsoft&#x00AE; Active Directory&#x00AE; domain.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdge">Kun tämä käytäntö ja automaattinen päivitys on käytössä, Microsoft Edge päivitetään tämän käytännön arvon määrittämään versioon.

Käytännön arvon tulee olla tietty Microsoft Edge-versio, kuten esimerkiksi 83.0.499.12.

Jos laitteessa on määritettyä arvoa uudempi versio, Microsoft Edgen uudempi versio säilytetään, eikä sitä vaihdeta aiempaan versioon.

Jos määritettyä versiota ei ole olemassa tai jos versio on muotoiltu väärin, Microsoft Edgen nykyinen versio säilyy, eikä sitä päivitetä automaattisesti uusiin versioihin.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136707.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdge">Määrittää, että Microsoft Edge Updaten tulee palauttaa Microsoft Edgen asennukset käytännössä 'Kohdeversion ohitus' kuvattuun versioon.

Tällä käytännöllä ei ole vaikutusta, ellei käytäntöä 'Kohdeversion ohitus' ole määritetty ja käytäntöä 'Päivityskäytännön korvaus' määritetty KÄYTÖSSÄ-tilaan (joko Salli päivitykset aina, Vain automaattiset päivitykset taustalla tai Vain manuaaliset päivitykset).

Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, asennuksiin, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, ei tehdä muutoksia.

Jos käytäntö otetaan käyttöön, asennukset, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, palautetaan kohdeversioon.

Käyttäjien on suositeltavaa asentaa Microsoft Edge -selaimen uusin versio, jotta voidaan taata viimeisimpien suojauspäivitysten tarjoama suojaus. Aiempaan versioon palauttaminen altistaa tunnetuille suojausongelmille. Tätä käytäntöä tulee käyttää paikallisena korjauksena, jonka avulla voidaan korjata ongelmia Microsoft Edge -selainpäivityksessä.

Ennen kuin palautat selainversion tilapäisesti aiempaan versioon, synkronointi on suositeltavaa ottaa käyttöön (https://go.microsoft.com/fwlink/?linkid=2133032) kaikilla organisaation käyttäjillä. Jos synkronointia ei oteta käyttöön, selaintietojen pysyvä menettäminen on mahdollista. Käytä käytäntöä omalla riskilläsi.

Huomautus: kaikkia versioita, joihin version voi palauttaa, voi tarkastella osoitteessa https://aka.ms/EdgeEnterprise.

Tämä käytäntö koskee Microsoft Edgen versiota 86 ja uudempia versioita.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2133918.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Cat_MicrosoftEdgeBeta">Microsoft Edge Beta</string>
      <string id="Explain_InstallMicrosoftEdgeBeta">Määrittää, voiko Microsoft Edgen kanavan asentaa toimialueeseen liitettyihin laitteisiin.

  Jos otat tämän käytännön käyttöön kanavalla, Microsoft Edgen asennus sallitaan.

  Jos poistat tämän käytännön käytöstä kanavalla, Microsoft Edgen asennus estetään.

  Jos tätä käytäntöä ei määritetä kanavalla, oletusarvoinen käytäntömääritys Salli asennus oletusarvoisesti määrittää, voivatko käyttäjät asentaa Microsoft Edgen kanavan.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeBeta">Määrittää, miten Microsoft Edge Update käsittelee Microsoft Edgelle saatavilla olevia päivityksiä.

Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti. (Kaikki sovellukset eivät sisällä tätä ominaisuutta.)
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset OLETUSARVOISEN KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136406.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeBeta">Specifies which Channel Microsoft Edge Beta should be updated to.

When this policy is enabled, the app will be updated to the Channel with this policy value.

Some examples:
1) Not configured: app will be updated to the latest version available in the default Channel for the app.
2) Policy value is set to "stable": the app will be updated to the latest stable version.
2) Policy value is set to "beta": the app will be updated to the latest beta version.
2) Policy value is set to "dev": the app will be updated to the latest dev version.
This policy is available only on Windows instances that are joined to a Microsoft&#x00AE; Active Directory&#x00AE; domain.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeBeta">Kun tämä käytäntö ja automaattinen päivitys on käytössä, Microsoft Edge päivitetään tämän käytännön arvon määrittämään versioon.

Käytännön arvon tulee olla tietty Microsoft Edge-versio, kuten esimerkiksi 83.0.499.12.

Jos laitteessa on määritettyä arvoa uudempi versio, Microsoft Edgen uudempi versio säilytetään, eikä sitä vaihdeta aiempaan versioon.

Jos määritettyä versiota ei ole olemassa tai jos versio on muotoiltu väärin, Microsoft Edgen nykyinen versio säilyy, eikä sitä päivitetä automaattisesti uusiin versioihin.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136707.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeBeta">Määrittää, että Microsoft Edge Updaten tulee palauttaa Microsoft Edgen asennukset käytännössä 'Kohdeversion ohitus' kuvattuun versioon.

Tällä käytännöllä ei ole vaikutusta, ellei käytäntöä 'Kohdeversion ohitus' ole määritetty ja käytäntöä 'Päivityskäytännön korvaus' määritetty KÄYTÖSSÄ-tilaan (joko Salli päivitykset aina, Vain automaattiset päivitykset taustalla tai Vain manuaaliset päivitykset).

Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, asennuksiin, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, ei tehdä muutoksia.

Jos käytäntö otetaan käyttöön, asennukset, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, palautetaan kohdeversioon.

Käyttäjien on suositeltavaa asentaa Microsoft Edge -selaimen uusin versio, jotta voidaan taata viimeisimpien suojauspäivitysten tarjoama suojaus. Aiempaan versioon palauttaminen altistaa tunnetuille suojausongelmille. Tätä käytäntöä tulee käyttää paikallisena korjauksena, jonka avulla voidaan korjata ongelmia Microsoft Edge -selainpäivityksessä.

Ennen kuin palautat selainversion tilapäisesti aiempaan versioon, synkronointi on suositeltavaa ottaa käyttöön (https://go.microsoft.com/fwlink/?linkid=2133032) kaikilla organisaation käyttäjillä. Jos synkronointia ei oteta käyttöön, selaintietojen pysyvä menettäminen on mahdollista. Käytä käytäntöä omalla riskilläsi.

Huomautus: kaikkia versioita, joihin version voi palauttaa, voi tarkastella osoitteessa https://aka.ms/EdgeEnterprise.

Tämä käytäntö koskee Microsoft Edgen versiota 86 ja uudempia versioita.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2133918.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Cat_MicrosoftEdgeDev">Microsoft Edge Dev</string>
      <string id="Explain_InstallMicrosoftEdgeDev">Määrittää, voiko Microsoft Edgen kanavan asentaa toimialueeseen liitettyihin laitteisiin.

  Jos otat tämän käytännön käyttöön kanavalla, Microsoft Edgen asennus sallitaan.

  Jos poistat tämän käytännön käytöstä kanavalla, Microsoft Edgen asennus estetään.

  Jos tätä käytäntöä ei määritetä kanavalla, oletusarvoinen käytäntömääritys Salli asennus oletusarvoisesti määrittää, voivatko käyttäjät asentaa Microsoft Edgen kanavan.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeDev">Määrittää, miten Microsoft Edge Update käsittelee Microsoft Edgelle saatavilla olevia päivityksiä.

Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti. (Kaikki sovellukset eivät sisällä tätä ominaisuutta.)
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset OLETUSARVOISEN KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136406.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeDev">Specifies which Channel Microsoft Edge Dev should be updated to.

When this policy is enabled, the app will be updated to the Channel with this policy value.

Some examples:
1) Not configured: app will be updated to the latest version available in the default Channel for the app.
2) Policy value is set to "stable": the app will be updated to the latest stable version.
2) Policy value is set to "beta": the app will be updated to the latest beta version.
2) Policy value is set to "dev": the app will be updated to the latest dev version.
This policy is available only on Windows instances that are joined to a Microsoft&#x00AE; Active Directory&#x00AE; domain.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeDev">Kun tämä käytäntö ja automaattinen päivitys on käytössä, Microsoft Edge päivitetään tämän käytännön arvon määrittämään versioon.

Käytännön arvon tulee olla tietty Microsoft Edge-versio, kuten esimerkiksi 83.0.499.12.

Jos laitteessa on määritettyä arvoa uudempi versio, Microsoft Edgen uudempi versio säilytetään, eikä sitä vaihdeta aiempaan versioon.

Jos määritettyä versiota ei ole olemassa tai jos versio on muotoiltu väärin, Microsoft Edgen nykyinen versio säilyy, eikä sitä päivitetä automaattisesti uusiin versioihin.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136707.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeDev">Määrittää, että Microsoft Edge Updaten tulee palauttaa Microsoft Edgen asennukset käytännössä 'Kohdeversion ohitus' kuvattuun versioon.

Tällä käytännöllä ei ole vaikutusta, ellei käytäntöä 'Kohdeversion ohitus' ole määritetty ja käytäntöä 'Päivityskäytännön korvaus' määritetty KÄYTÖSSÄ-tilaan (joko Salli päivitykset aina, Vain automaattiset päivitykset taustalla tai Vain manuaaliset päivitykset).

Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, asennuksiin, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, ei tehdä muutoksia.

Jos käytäntö otetaan käyttöön, asennukset, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, palautetaan kohdeversioon.

Käyttäjien on suositeltavaa asentaa Microsoft Edge -selaimen uusin versio, jotta voidaan taata viimeisimpien suojauspäivitysten tarjoama suojaus. Aiempaan versioon palauttaminen altistaa tunnetuille suojausongelmille. Tätä käytäntöä tulee käyttää paikallisena korjauksena, jonka avulla voidaan korjata ongelmia Microsoft Edge -selainpäivityksessä.

Ennen kuin palautat selainversion tilapäisesti aiempaan versioon, synkronointi on suositeltavaa ottaa käyttöön (https://go.microsoft.com/fwlink/?linkid=2133032) kaikilla organisaation käyttäjillä. Jos synkronointia ei oteta käyttöön, selaintietojen pysyvä menettäminen on mahdollista. Käytä käytäntöä omalla riskilläsi.

Huomautus: kaikkia versioita, joihin version voi palauttaa, voi tarkastella osoitteessa https://aka.ms/EdgeEnterprise.

Tämä käytäntö koskee Microsoft Edgen versiota 86 ja uudempia versioita.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2133918.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Cat_MicrosoftEdgeCanary">Microsoft Edge Canary</string>
      <string id="Explain_InstallMicrosoftEdgeCanary">Määrittää, voiko Microsoft Edgen kanavan asentaa toimialueeseen liitettyihin laitteisiin.

  Jos otat tämän käytännön käyttöön kanavalla, Microsoft Edgen asennus sallitaan.

  Jos poistat tämän käytännön käytöstä kanavalla, Microsoft Edgen asennus estetään.

  Jos tätä käytäntöä ei määritetä kanavalla, oletusarvoinen käytäntömääritys Salli asennus oletusarvoisesti määrittää, voivatko käyttäjät asentaa Microsoft Edgen kanavan.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeCanary">Määrittää, miten Microsoft Edge Update käsittelee Microsoft Edgelle saatavilla olevia päivityksiä.

Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti. (Kaikki sovellukset eivät sisällä tätä ominaisuutta.)
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset OLETUSARVOISEN KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136406.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeCanary">Specifies which Channel Microsoft Edge Canary should be updated to.

When this policy is enabled, the app will be updated to the Channel with this policy value.

Some examples:
1) Not configured: app will be updated to the latest version available in the default Channel for the app.
2) Policy value is set to "stable": the app will be updated to the latest stable version.
2) Policy value is set to "beta": the app will be updated to the latest beta version.
2) Policy value is set to "dev": the app will be updated to the latest dev version.
This policy is available only on Windows instances that are joined to a Microsoft&#x00AE; Active Directory&#x00AE; domain.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeCanary">Kun tämä käytäntö ja automaattinen päivitys on käytössä, Microsoft Edge päivitetään tämän käytännön arvon määrittämään versioon.

Käytännön arvon tulee olla tietty Microsoft Edge-versio, kuten esimerkiksi 83.0.499.12.

Jos laitteessa on määritettyä arvoa uudempi versio, Microsoft Edgen uudempi versio säilytetään, eikä sitä vaihdeta aiempaan versioon.

Jos määritettyä versiota ei ole olemassa tai jos versio on muotoiltu väärin, Microsoft Edgen nykyinen versio säilyy, eikä sitä päivitetä automaattisesti uusiin versioihin.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136707.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeCanary">Määrittää, että Microsoft Edge Updaten tulee palauttaa Microsoft Edgen asennukset käytännössä 'Kohdeversion ohitus' kuvattuun versioon.

Tällä käytännöllä ei ole vaikutusta, ellei käytäntöä 'Kohdeversion ohitus' ole määritetty ja käytäntöä 'Päivityskäytännön korvaus' määritetty KÄYTÖSSÄ-tilaan (joko Salli päivitykset aina, Vain automaattiset päivitykset taustalla tai Vain manuaaliset päivitykset).

Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, asennuksiin, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, ei tehdä muutoksia.

Jos käytäntö otetaan käyttöön, asennukset, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, palautetaan kohdeversioon.

Käyttäjien on suositeltavaa asentaa Microsoft Edge -selaimen uusin versio, jotta voidaan taata viimeisimpien suojauspäivitysten tarjoama suojaus. Aiempaan versioon palauttaminen altistaa tunnetuille suojausongelmille. Tätä käytäntöä tulee käyttää paikallisena korjauksena, jonka avulla voidaan korjata ongelmia Microsoft Edge -selainpäivityksessä.

Ennen kuin palautat selainversion tilapäisesti aiempaan versioon, synkronointi on suositeltavaa ottaa käyttöön (https://go.microsoft.com/fwlink/?linkid=2133032) kaikilla organisaation käyttäjillä. Jos synkronointia ei oteta käyttöön, selaintietojen pysyvä menettäminen on mahdollista. Käytä käytäntöä omalla riskilläsi.

Huomautus: kaikkia versioita, joihin version voi palauttaa, voi tarkastella osoitteessa https://aka.ms/EdgeEnterprise.

Tämä käytäntö koskee Microsoft Edgen versiota 86 ja uudempia versioita.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2133918.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Cat_MicrosoftEdgeWebView">Microsoft Edge WebView</string>
      <string id="Explain_InstallMicrosoftEdgeWebView">Määrittää, voiko Microsoft Edgen kanavan asentaa toimialueeseen liitettyihin laitteisiin.

  Jos otat tämän käytännön käyttöön kanavalla, Microsoft Edgen asennus sallitaan.

  Jos poistat tämän käytännön käytöstä kanavalla, Microsoft Edgen asennus estetään.

  Jos tätä käytäntöä ei määritetä kanavalla, oletusarvoinen käytäntömääritys Salli asennus oletusarvoisesti määrittää, voivatko käyttäjät asentaa Microsoft Edgen kanavan.

  Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeWebView">Määrittää, miten Microsoft Edge Update käsittelee Microsoft Edgelle saatavilla olevia päivityksiä.

Jos otat tämän käytäntöasetuksen käyttöön, Microsoft Edge Update käsittelee Microsoft Edge -päivityksiä sen mukaan, miten määrität seuraavat asetukset:
   – Salli päivitykset aina: Päivitykset otetaan käyttöön aina, kun niitä löydetään joko säännöllisen päivitysten tarkistamisen tai manuaalisen päivitysten tarkistamisen aikana.
   – Vain automaattiset hiljaiset päivitykset: Päivitykset otetaan käyttöön vain, jos niitä löydetään säännöllisen päivitysten tarkistamisen aikana.
   – Vain manuaaliset päivitykset: Päivitykset otetaan käyttöön vain, jos käyttäjä tarkistaa päivitykset manuaalisesti. (Kaikki sovellukset eivät sisällä tätä ominaisuutta.)
   – Päivitykset poistettu käytöstä: Päivityksiä ei oteta koskaan käyttöön.

  Jos valitset manuaaliset päivitykset, muista tarkistaa päivitysten saatavuus säännöllisesti sovelluksen manuaalisen päivitysmenetelmän avulla, jos kyseinen ominaisuus on käytettävissä. Jos poistat päivitykset käytöstä, tarkista päivitysten saatavuus säännöllisesti ja jaa ne käyttäjille.

  Jos et ota tätä käytäntöasetusta käyttöön ja määritä sitä, Microsoft Edge Update käsittelee saatavilla olevat päivitykset OLETUSARVOISEN KÄYTÄNNÖN NIMEN PÄIVITYS -käytäntöasetuksessa määritetyllä tavalla.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136406.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeWebView">Specifies which Channel Microsoft Edge WebView should be updated to.

When this policy is enabled, the app will be updated to the Channel with this policy value.

Some examples:
1) Not configured: app will be updated to the latest version available in the default Channel for the app.
2) Policy value is set to "stable": the app will be updated to the latest stable version.
2) Policy value is set to "beta": the app will be updated to the latest beta version.
2) Policy value is set to "dev": the app will be updated to the latest dev version.
This policy is available only on Windows instances that are joined to a Microsoft&#x00AE; Active Directory&#x00AE; domain.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeWebView">Kun tämä käytäntö ja automaattinen päivitys on käytössä, Microsoft Edge päivitetään tämän käytännön arvon määrittämään versioon.

Käytännön arvon tulee olla tietty Microsoft Edge-versio, kuten esimerkiksi 83.0.499.12.

Jos laitteessa on määritettyä arvoa uudempi versio, Microsoft Edgen uudempi versio säilytetään, eikä sitä vaihdeta aiempaan versioon.

Jos määritettyä versiota ei ole olemassa tai jos versio on muotoiltu väärin, Microsoft Edgen nykyinen versio säilyy, eikä sitä päivitetä automaattisesti uusiin versioihin.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2136707.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeWebView">Määrittää, että Microsoft Edge Updaten tulee palauttaa Microsoft Edgen asennukset käytännössä 'Kohdeversion ohitus' kuvattuun versioon.

Tällä käytännöllä ei ole vaikutusta, ellei käytäntöä 'Kohdeversion ohitus' ole määritetty ja käytäntöä 'Päivityskäytännön korvaus' määritetty KÄYTÖSSÄ-tilaan (joko Salli päivitykset aina, Vain automaattiset päivitykset taustalla tai Vain manuaaliset päivitykset).

Jos käytäntö poistetaan käytöstä tai sitä ei määritetä, asennuksiin, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, ei tehdä muutoksia.

Jos käytäntö otetaan käyttöön, asennukset, joiden nykyinen versio on suurempi kuin käytännössä 'Kohdeversion ohitus' määritetty versio, palautetaan kohdeversioon.

Käyttäjien on suositeltavaa asentaa Microsoft Edge -selaimen uusin versio, jotta voidaan taata viimeisimpien suojauspäivitysten tarjoama suojaus. Aiempaan versioon palauttaminen altistaa tunnetuille suojausongelmille. Tätä käytäntöä tulee käyttää paikallisena korjauksena, jonka avulla voidaan korjata ongelmia Microsoft Edge -selainpäivityksessä.

Ennen kuin palautat selainversion tilapäisesti aiempaan versioon, synkronointi on suositeltavaa ottaa käyttöön (https://go.microsoft.com/fwlink/?linkid=2133032) kaikilla organisaation käyttäjillä. Jos synkronointia ei oteta käyttöön, selaintietojen pysyvä menettäminen on mahdollista. Käytä käytäntöä omalla riskilläsi.

Huomautus: kaikkia versioita, joihin version voi palauttaa, voi tarkastella osoitteessa https://aka.ms/EdgeEnterprise.

Tämä käytäntö koskee Microsoft Edgen versiota 86 ja uudempia versioita.

Saat lisätietoja osoitteesta https://go.microsoft.com/fwlink/?linkid=2133918.

Tämä käytäntö on käytettävissä vain Windows-esiintymissä, jotka on liitetty Microsoft® Active Directory® -toimialueeseen.</string>
    </stringTable>
    <presentationTable>
      <presentation id="Pol_AutoUpdateCheckPeriod">
        <decimalTextBox refId="Part_AutoUpdateCheckPeriod" defaultValue="1400"
            spinStep="60">Päivitysten tarkistusten väliset minuutit</decimalTextBox>
      </presentation>
      <presentation id="Pol_UpdateCheckSuppressedPeriod">
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartHour"
            defaultValue="0" spinStep="1">Tunti</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartMin"
            defaultValue="0" spinStep="1">Minuutti</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedDurationMin"
            defaultValue="60">Kesto</decimalTextBox>
      </presentation>
      <presentation id="Pol_DownloadPreference">
        <dropdownList refId="Part_DownloadPreference"
            defaultItem="0">Pyydettävän lataus-URL-osoitteen tyyppi</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyMode">
        <dropdownList refId="Part_ProxyMode"
            defaultItem="0">Valitse välitys palvelimen asetusten määrittäminen
        </dropdownList>
      </presentation>
      <presentation id="Pol_ProxyServer">
        <textBox refId="Part_ProxyServer">
          <label>Välityspalvelimen osoite tai URL-osoite</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ProxyPacUrl">
        <textBox refId="Part_ProxyPacUrl">
          <label>Välityspalvelimen .pac-tiedoston URL-osoite</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_DefaultAllowInstallation" />
      <presentation id="Pol_DefaultUpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Päivityskäytäntö</dropdownList>
      </presentation>
      <presentation id="Pol_AllowInstallation" />
      <presentation id="Pol_UpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Päivityskäytäntö</dropdownList>
      </presentation>      <presentation id="Pol_TargetVersionPrefix">
        <textBox refId="Part_TargetVersionPrefix">
          <label>Kohdeversio</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ECSControl">
        <dropdownList refId="Part_ECSControl"
            defaultItem="1">Hallitse päivitystyökalun kokeilu- ja määrityspalvelun kanssa tapahtuvaa tiedonsiirtoa</dropdownList>
      </presentation>
      <presentation id="Pol_RollbackToTargetVersion" />
      <presentation id="Pol_AllowSideBySideExperience" />
      <presentation id="Pol_DefaultCreateDesktopShortcut" />
      <presentation id="Pol_CreateDesktopShortcut" />

    </presentationTable>
  </resources>
</policyDefinitionResources>